In [1]:
import pandas as pd

In [2]:
df_1 = pd.read_csv('book1-100k.csv')

In [3]:
df_1.head(1)

,Id,Name,RatingDist1,pagesNumber,RatingDist4,RatingDistTotal,PublishMonth,PublishDay,Publisher,CountsOfReview,PublishYear,Language,Authors,Rating,RatingDist2,RatingDist5,ISBN,RatingDist3
0,1,Harry Potter and the Half-Blood Prince (Harry ...,1:9896,652,4:556485,total:2298124,16,9,Scholastic Inc.,28062,2006,eng,J.K. Rowling,4.57,2:25317,5:1546466,NaN,3:159960

In [4]:
df_1 = df_1[['Id', 'Name', 'Authors', 'Publisher', 'PublishYear', 'ISBN', 'Rating']]
df_1.head(2)

,Id,Name,Authors,Publisher,PublishYear,ISBN,Rating
0,1,Harry Potter and the Half-Blood Prince (Harry ...,J.K. Rowling,Scholastic Inc.,2006,NaN,4.57
1,2,Harry Potter and the Order of the Phoenix (Har...,J.K. Rowling,Scholastic Inc.,2004,0439358078,4.50

In [5]:
df_1.shape

(58292, 7)

In [6]:
df_2 = pd.read_csv('book100k-200k.csv')
df_2 = df_2[['Id', 'Name', 'Authors', 'Publisher', 'PublishYear', 'ISBN', 'Rating']]
df_2.head(2)

,Id,Name,Authors,Publisher,PublishYear,ISBN,Rating
0,100000,The Best American Political Writing 2004: Spec...,Royce Flippin,PublicAffairs,2004,1560256133,4.18
1,100004,Stephen Hawking: Understanding the Universe,Gail Sakurai,Turtleback Books,1996,061390737X,4.00

In [7]:
df_2.shape

(57046, 7)

In [8]:
book_rating = df_1.append(df_2)
book_rating.shape

(115338, 7)

In [9]:
for i in range(200, 1901, 100):
    df = pd.read_csv('book' + str(i) + 'k-' + str(100 + i) + 'k.csv')
    df = df[['Id', 'Name', 'Authors', 'Publisher', 'PublishYear', 'ISBN', 'Rating']]
    book_rating = book_rating.append(df)

In [10]:
book_rating.head(5)

,Id,Name,Authors,Publisher,PublishYear,ISBN,Rating
0,1,Harry Potter and the Half-Blood Prince (Harry ...,J.K. Rowling,Scholastic Inc.,2006,NaN,4.57
1,2,Harry Potter and the Order of the Phoenix (Har...,J.K. Rowling,Scholastic Inc.,2004,0439358078,4.50
2,3,Harry Potter and the Sorcerer's Stone (Harry P...,J.K. Rowling,Scholastic Inc,2003,NaN,4.47
3,4,Harry Potter and the Chamber of Secrets (Harry...,J.K. Rowling,Scholastic,2003,0439554896,4.42
4,5,Harry Potter and the Prisoner of Azkaban (Harr...,J.K. Rowling,Scholastic Inc.,2004,043965548X,4.57

In [12]:
book_rating = book_rating.drop_duplicates()
book_rating.shape

(917313, 7)

In [13]:
for i in range(2000, 3001, 1000):
    df = pd.read_csv('book' + str(i) + 'k-' + str(1000 + i) + 'k.csv')
    df = df[['Id', 'Name', 'Authors', 'Publisher', 'PublishYear', 'ISBN', 'Rating']]
    book_rating = book_rating.append(df)

In [20]:
book_rating = book_rating.drop_duplicates()
book_rating.shape

(1569865, 7)

In [ ]:
boook

In [15]:
book_rating.to_csv('book_rating.csv', index=False)

In [16]:
df = pd.read_csv('book_rating.csv')

In [19]:
df.head(5)

,Unnamed: 0,Id,Name,Authors,Publisher,PublishYear,ISBN,Rating
0,0,1,Harry Potter and the Half-Blood Prince (Harry ...,J.K. Rowling,Scholastic Inc.,2006,NaN,4.57
1,1,2,Harry Potter and the Order of the Phoenix (Har...,J.K. Rowling,Scholastic Inc.,2004,0439358078,4.50
2,2,3,Harry Potter and the Sorcerer's Stone (Harry P...,J.K. Rowling,Scholastic Inc,2003,NaN,4.47
3,3,4,Harry Potter and the Chamber of Secrets (Harry...,J.K. Rowling,Scholastic,2003,0439554896,4.42
4,4,5,Harry Potter and the Prisoner of Azkaban (Harr...,J.K. Rowling,Scholastic Inc.,2004,043965548X,4.57